# Import necessary libraries

In [3]:
import pandas as pd

# Download Data from the API

In [4]:
# Download dataset 
# Dataset Description - Summary information and metrics for Airbnb listings in London - 2025-09-14
!wget https://data.insideairbnb.com/united-kingdom/england/london/2025-09-14/visualisations/listings.csv -O lndn_listings.csv

--2025-11-15 04:09:57--  https://data.insideairbnb.com/united-kingdom/england/london/2025-09-14/visualisations/listings.csv
Resolving data.insideairbnb.com (data.insideairbnb.com)... 3.164.206.36, 3.164.206.7, 3.164.206.19, ...
Connecting to data.insideairbnb.com (data.insideairbnb.com)|3.164.206.36|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 14559227 (14M) [application/csv]
Saving to: ‘lndn_listings.csv’

lndn_listings.csv   100%[===================>]  13.88M  11.4MB/s    in 1.2s

2025-11-15 04:09:59 (11.4 MB/s) - ‘lndn_listings.csv’ saved [14559227/14559227]

# 1. Data Loading and Initial Exploration

In [5]:
# Load the dataset
df = pd.read_csv("lndn_listings.csv")

In [6]:
# View the first five rows
df.head()

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365,number_of_reviews_ltm,license
0,13913,Holiday London DB Room Let-on going,54730,Alina,NaN,Islington,51.56861,-0.11270,Private room,70.0,1,55,2025-08-21,0.30,2,331,10,NaN
1,15400,Bright Chelsea Apartment. Chelsea!,60302,Philippa,NaN,Kensington and Chelsea,51.48780,-0.16813,Entire home/apt,149.0,4,97,2025-04-05,0.51,1,199,1,NaN
2,17402,Very Central Modern 3-Bed/2 Bath By Oxford St W1,67564,Liz,NaN,Westminster,51.52195,-0.14094,Entire home/apt,411.0,3,56,2024-02-19,0.32,2,80,0,NaN
3,24328,Battersea live/work artist house,41759,Joe,NaN,Wandsworth,51.47072,-0.16266,Entire home/apt,NaN,7,95,2025-07-05,0.53,1,294,1,NaN
4,36274,Bright 1 bedroom apt off brick lane in Shoreditch,133271,Hendryks,NaN,Tower Hamlets,51.52322,-0.06979,Entire home/apt,210.0,5,15,2025-09-06,0.09,2,323,6,NaN

In [7]:
# Initial Info (Column types and non-null counts)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 96871 entries, 0 to 96870
Data columns (total 18 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   id                              96871 non-null  int64
 1   name                            96871 non-null  object
 2   host_id                         96871 non-null  int64
 3   host_name                       96828 non-null  object
 4   neighbourhood_group             0 non-null      float64
 5   neighbourhood                   96871 non-null  object
 6   latitude                        96871 non-null  float64
 7   longitude                       96871 non-null  float64
 8   room_type                       96871 non-null  object
 9   price                           61963 non-null  float64
 10  minimum_nights                  96871 non-null  int64
 11  number_of_reviews               96871 non-null  int64
 12  last_review                     72749 non-null  object
 13  reviews_per_month               72749 non-null  float64
 14  calculated_host_listings_count  96871 non-null  int64
 15  availability_365                96871 non-null  int64
 16  number_of_reviews_ltm           96871 non-null  int64
 17  license                         0 non-null      float64
dtypes: float64(6), int64(7), object(5)
memory usage: 13.3+ MB

In [8]:
# Initial Description (Summary statistics) including non-numeric column
df.describe(include='all')

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365,number_of_reviews_ltm,license
count,9.687100e+04,96871,9.687100e+04,96828,0.0,96871,96871.000000,96871.000000,96871,6.196300e+04,96871.000000,96871.000000,72749,72749.000000,96871.000000,96871.000000,96871.000000,0.0
unique,NaN,93341,NaN,16672,NaN,33,NaN,NaN,4,NaN,NaN,NaN,3605,NaN,NaN,NaN,NaN,NaN
top,NaN,Double room,NaN,James,NaN,Westminster,NaN,NaN,Entire home/apt,NaN,NaN,NaN,2025-08-31,NaN,NaN,NaN,NaN,NaN
freq,NaN,33,NaN,979,NaN,11385,NaN,NaN,62907,NaN,NaN,NaN,1655,NaN,NaN,NaN,NaN,NaN
mean,6.894448e+17,NaN,2.144494e+08,NaN,NaN,NaN,51.509740,-0.127638,NaN,2.299170e+02,5.440297,21.657627,NaN,0.990334,16.685499,144.927429,5.709614,NaN
std,5.941222e+17,NaN,2.196053e+08,NaN,NaN,NaN,0.049067,0.101112,NaN,4.437589e+03,23.686681,50.368644,NaN,1.304282,53.130290,141.808279,11.996770,NaN
min,1.391300e+04,NaN,2.594000e+03,NaN,NaN,NaN,51.295937,-0.496760,NaN,7.000000e+00,1.000000,0.000000,NaN,0.010000,1.000000,0.000000,0.000000,NaN
25%,3.026058e+07,NaN,2.726814e+07,NaN,NaN,NaN,51.484150,-0.189468,NaN,7.700000e+01,1.000000,1.000000,NaN,0.150000,1.000000,0.000000,0.000000,NaN
50%,8.505248e+17,NaN,1.164321e+08,NaN,NaN,NaN,51.513720,-0.127505,NaN,1.350000e+02,2.000000,5.000000,NaN,0.520000,2.000000,96.000000,0.000000,NaN
75%,1.254262e+18,NaN,4.198974e+08,NaN,NaN,NaN,51.539108,-0.068316,NaN,2.210000e+02,4.000000,20.000000,NaN,1.290000,8.000000,288.000000,6.000000,NaN
max,1.508964e+18,NaN,7.186905e+08,NaN,NaN,NaN,51.682630,0.278960,NaN,1.085147e+06,1125.000000,1902.000000,NaN,36.960000,500.000000,365.000000,390.000000,NaN

In [9]:
# Check for missing values
df.isnull().sum()

id                                    0
name                                  0
host_id                               0
host_name                            43
neighbourhood_group               96871
neighbourhood                         0
latitude                              0
longitude                             0
room_type                             0
price                             34908
minimum_nights                        0
number_of_reviews                     0
last_review                       24122
reviews_per_month                 24122
calculated_host_listings_count        0
availability_365                      0
number_of_reviews_ltm                 0
license                           96871
dtype: int64

In [10]:
# Check for duplicated rows
print(f"Number of duplicated rows: {df.duplicated().sum()}")

Number of duplicated rows: 0

In [11]:
# Check for unusual data types
df.dtypes

id                                  int64
name                               object
host_id                             int64
host_name                          object
neighbourhood_group               float64
neighbourhood                      object
latitude                          float64
longitude                         float64
room_type                          object
price                             float64
minimum_nights                      int64
number_of_reviews                   int64
last_review                        object
reviews_per_month                 float64
calculated_host_listings_count      int64
availability_365                    int64
number_of_reviews_ltm               int64
license                           float64
dtype: object

# 2. Data Cleaning

In [12]:
# Create a copy of df as working dataset to keep original intact
df_clean = df.copy()

In [14]:
# Convert 'price' fields (e.g., "$2,100.00") to float
df_clean['price'] = (
    df_clean['price']
    .replace('[\$,]', '', regex=True)
    .astype(float)
)

# Verify conversion
print(f"Price fields data type: {df_clean['price'].dtypes}")

Price fields data type: float64

In [24]:
# Parse dates (e.g., last_review) into datetime objects.
df_clean['last_review'] = pd.to_datetime(df_clean['last_review'])

print(f"Data type for `last_review` column: {df_clean['last_review'].dtypes}")

Data type for `last_review` column: datetime64[ns]

In [15]:
# Handle missing values in critical fields like reviews_per_month, host_name, and neighbourhood_group.
df_clean['reviews_per_month'] = df_clean['reviews_per_month'].fillna(0)
df_clean['host_name'] = df_clean['host_name'].fillna('Unknown')
df_clean['name'] = df_clean['name'].fillna('Unnamed Listing')
df_clean.head()

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365,number_of_reviews_ltm,license
0,13913,Holiday London DB Room Let-on going,54730,Alina,NaN,Islington,51.56861,-0.11270,Private room,70.0,1,55,2025-08-21,0.30,2,331,10,NaN
1,15400,Bright Chelsea Apartment. Chelsea!,60302,Philippa,NaN,Kensington and Chelsea,51.48780,-0.16813,Entire home/apt,149.0,4,97,2025-04-05,0.51,1,199,1,NaN
2,17402,Very Central Modern 3-Bed/2 Bath By Oxford St W1,67564,Liz,NaN,Westminster,51.52195,-0.14094,Entire home/apt,411.0,3,56,2024-02-19,0.32,2,80,0,NaN
3,24328,Battersea live/work artist house,41759,Joe,NaN,Wandsworth,51.47072,-0.16266,Entire home/apt,NaN,7,95,2025-07-05,0.53,1,294,1,NaN
4,36274,Bright 1 bedroom apt off brick lane in Shoreditch,133271,Hendryks,NaN,Tower Hamlets,51.52322,-0.06979,Entire home/apt,210.0,5,15,2025-09-06,0.09,2,323,6,NaN

In [25]:
# Remove irrelevant rows (e.g., listings with zero availability or price).
initial_rows = len(df_clean)

df.dropna(subset=['price'], inplace=True)

df_clean = df_clean[
    (df_clean['price'] > 0) &
    (df_clean['availability_365'] > 0)
]

rows_removed = initial_rows - len(df_clean)

print(f'Initial rows: {initial_rows}')
print(f'Final rows after cleaning: {len(df)}')
print(f"Rows dropped (NaN price, price=0, or availability=0): {rows_removed}")

Initial rows: 96871
Final rows after cleaning: 61963
Rows dropped (NaN price, price=0, or availability=0): 35740

# 3. Data Enrichment

In [17]:
# Create a price_per_booking column using price and minimum_nights.
df_clean['price_per_booking'] = (
    df_clean['price'] / df_clean['minimum_nights']
    ).round(2)

df_clean.head()

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365,number_of_reviews_ltm,license,price_per_booking
0,13913,Holiday London DB Room Let-on going,54730,Alina,NaN,Islington,51.56861,-0.11270,Private room,70.0,1,55,2025-08-21,0.30,2,331,10,NaN,70.00
1,15400,Bright Chelsea Apartment. Chelsea!,60302,Philippa,NaN,Kensington and Chelsea,51.48780,-0.16813,Entire home/apt,149.0,4,97,2025-04-05,0.51,1,199,1,NaN,37.25
2,17402,Very Central Modern 3-Bed/2 Bath By Oxford St W1,67564,Liz,NaN,Westminster,51.52195,-0.14094,Entire home/apt,411.0,3,56,2024-02-19,0.32,2,80,0,NaN,137.00
3,24328,Battersea live/work artist house,41759,Joe,NaN,Wandsworth,51.47072,-0.16266,Entire home/apt,NaN,7,95,2025-07-05,0.53,1,294,1,NaN,NaN
4,36274,Bright 1 bedroom apt off brick lane in Shoreditch,133271,Hendryks,NaN,Tower Hamlets,51.52322,-0.06979,Entire home/apt,210.0,5,15,2025-09-06,0.09,2,323,6,NaN,42.00

In [17]:
# Bucket availability into categories:
# - Full-time (availability > 300)
# - Part-time (100–300)
# - Rare (<100)

def categorize(availability_365):
    if availability_365 > 300:
        return 'Full-time'
    elif 100 <= availability_365 <= 300:
        return 'Part_time'
    else:
        return 'Rare '

df_clean['availability_bucket'] = df_clean['availability_365'].apply(categorize)
df_clean.head()

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365,number_of_reviews_ltm,license,availability_bucket
0,13913,Holiday London DB Room Let-on going,54730,Alina,NaN,Islington,51.56861,-0.11270,Private room,70.0,1,55,2025-08-21,0.30,2,331,10,NaN,Full-time
1,15400,Bright Chelsea Apartment. Chelsea!,60302,Philippa,NaN,Kensington and Chelsea,51.48780,-0.16813,Entire home/apt,149.0,4,97,2025-04-05,0.51,1,199,1,NaN,Part_time
2,17402,Very Central Modern 3-Bed/2 Bath By Oxford St W1,67564,Liz,NaN,Westminster,51.52195,-0.14094,Entire home/apt,411.0,3,56,2024-02-19,0.32,2,80,0,NaN,Rare
3,24328,Battersea live/work artist house,41759,Joe,NaN,Wandsworth,51.47072,-0.16266,Entire home/apt,NaN,7,95,2025-07-05,0.53,1,294,1,NaN,Part_time
4,36274,Bright 1 bedroom apt off brick lane in Shoreditch,133271,Hendryks,NaN,Tower Hamlets,51.52322,-0.06979,Entire home/apt,210.0,5,15,2025-09-06,0.09,2,323,6,NaN,Full-time

In [21]:
import os
os.makedirs("data", exist_ok=True) 
df_clean.to_csv("data/london_cleaned.csv", index=False)

# 4. Data Analysis Using Pandas

#### i. What are the top 10 most expensive neighborhoods by average price?

In [18]:
top_neighborhood = df_clean.groupby('neighbourhood') \
    .agg(avg_price = ('price', 'mean'), count=('price', 'count')) \
    .round(2) \
    .sort_values(by='avg_price', ascending=False) \
    .head(10) \
    .reset_index()

print("Top 10 most expensive neighborhoods by average price: \n")
top_neighborhood

#print(top_neighborhood.to_markdown(index=False))

Top 10 most expensive neighborhoods by average price:

            neighbourhood  avg_price  count
0           Tower Hamlets     430.91   4275
1          City of London     354.39    436
2                 Lambeth     345.71   2821
3             Westminster     342.14   8443
4  Kensington and Chelsea     336.07   4768
5               Islington     217.55   2756
6                  Camden     216.51   4330
7  Hammersmith and Fulham     199.19   2669
8              Wandsworth     198.43   3012
9    Richmond upon Thames     184.27    812

#### ii. What’s the average availability and price by room type?

In [19]:
room_type_stats = df_clean.groupby('room_type', as_index=False) \
    .agg(avg_price = ('price', 'mean'), avg_availability = ('availability_365', 'mean')) \
    .round(2) \

print("Average availability and price by room type: \n")
room_type_stats

#print(room_type_stats.to_markdown(index=False))

Average availability and price by room type:

         room_type  avg_price  avg_availability
0  Entire home/apt     279.35            148.97
1       Hotel room     657.83            191.51
2     Private room     121.71            136.69
3      Shared room      96.91            227.55

#### iii. Which host has the most listings?

In [20]:
most_listings = df_clean.groupby(['host_id', 'host_name'], as_index=False) \
    .agg(qty = ('id',"count")) \
    .sort_values(by="qty", ascending=False) \
    .head(1)

print('Host with the most listings: \n')
most_listings

#print(most_listings.to_markdown(index=False))

Host with the most listings:

         host_id          host_name  qty
46310  446820235  LuxurybookingsFZE  500

#### iv. How does average price vary across different boroughs or districts?

In [29]:
borough_price = df_clean.groupby('neighbourhood') \
    .agg(avg_price = ("price", "mean"), qty = ("price", "count")) \
    .sort_values(by="avg_price", ascending=False) \
    .reset_index()

print("Average price by borough neighbourhood: \n")
borough_price

#print(borough_price.to_markdown(index=False))

Average price by borough neighbourhood:

             neighbourhood   avg_price   qty
0            Tower Hamlets  434.835867  4210
1           City of London  353.923611   432
2                  Lambeth  346.183966  2794
3              Westminster  340.723515  8297
4   Kensington and Chelsea  334.646430  4678
5                   Camden  216.279793  4246
6                Islington  213.680741  2700
7   Hammersmith and Fulham  198.096052  2634
8               Wandsworth  197.738255  2980
9     Richmond upon Thames  184.068579   802
10               Southwark  173.719154  3169
11                   Brent  172.788357  2027
12                 Hackney  159.935751  3144
13                  Newham  154.492647  1632
14                Hounslow  149.869074   886
15                  Merton  148.000000   959
16               Greenwich  145.886707  1324
17                  Ealing  140.700315  1585
18                Haringey  139.163624  1479
19                  Barnet  138.666278  1717
20    Kingston upon Thames  138.426804   485
21                Havering  129.892272   427
22                 Bromley  128.832335   668
23               Redbridge  128.504841   723
24                Lewisham  120.569653  1529
25                 Enfield  120.036309   661
26                  Bexley  118.612576   493
27          Waltham Forest  117.651591  1194
28    Barking and Dagenham  108.503676   544
29              Hillingdon  108.495091   713
30                  Harrow  107.644105   458
31                 Croydon  102.446989  1179
32                  Sutton   97.091160   362

#### v. How many listings have never been reviewed?

In [23]:
no_review = df_clean[df_clean['number_of_reviews'] == 0] \
    .shape[0]# count number of rows

print(f"The number of listings with no review: {no_review}")

The number of listings with no review: 24122

# Key Insights

1. The most expensive neighborhoods (Top 10) are consistently located in **Central London** (e.g., Kensington & Chelsea, Westminster, Camden), reflecting the premium for proximity to major tourist attractions and business centers.
   
2. **Price** is strongly correlated with both the **type of accommodation** and its **location**.

3. **Private Rooms** often show higher availability, potentially indicating primary residents listing rooms casually or consistently when they are not in use.

4. A significant number of active listings have **zero reviews** which suggests that a large portion of the inventory are potentially new, non-operational, or have a very low booking rate.

#### Checking!!!

In [26]:
# Full dataset shape (rows, column)
print(df.shape)

(61963, 18)

In [27]:
# Full cleaned dataset shape (rows, columns)
print(df_clean.shape)

(61131, 19)

In [28]:
# Full dataset shape (rows, column)
print(df.shape)

(96871, 18)

In [29]:
# Full cleaned dataset shape (rows, columns)
print(df_clean.shape)

(96871, 20)